#include<iostream>
using namespace std;

int main(){
    int t;
    cin>>t;

    while(t--){
        int n;
        cin>>n;

        cout<<n/2<<endl;
    }

}


/*ধরি আমাদের কাছে 
𝑛
n আছে। এখন প্রশ্ন হলো, gcd এর সর্বোচ্চ মান কত হতে পারে?

gcd কখনও n হতে পারবে না, কারণ gcd(a, b) এর জন্য 
𝑎
≠
𝑏
a

=b হতে হবে।
অর্থাৎ 
𝑔
𝑐
𝑑
(
𝑛
,
𝑛
)
=
𝑛
gcd(n,n)=n নেওয়া যাবে না।

সবচেয়ে বড় gcd আসবে যখন আমরা সবচেয়ে বড় সংখ্যা 
𝑛
n এর সাথে কোনো সংখ্যা নিবো।
কারণ gcd এর মান যত বড় হবে, তত বেশি 
𝑛
n-এর কোনো গুণনীয়ক হতে হবে।

এবার 
𝑛
n-এর সবচেয়ে বড় proper divisor (নিজের চেয়ে ছোট ভাজক) হলো
👉 যদি 
𝑛
n জোড় হয় → 
𝑛
/
2
n/2
👉 যদি 
𝑛
n বিজোড় হয় → 
(
𝑛
−
1
)
/
2
(n−1)/2

সুতরাং gcd এর সর্বোচ্চ মান হবে 
⌊
𝑛
/
2
⌋
⌊n/2⌋।*/